{
  "nav": [
    {
      "name": "HOME",
      "link": "/"
    },
    {
      "name": "ABOUT US",
      "link": "about-us"
    },
    {
      "name": "SERVICES",
      "link": "services"
    },
    {
      "name": "FAQs",
      "link": "faqs"
    },
    {
      "name": "CONTACT US",
      "link": "contact-us"
    },
    {
      "name": "GET A QUOTE",
      "link": "contact-us"
    }
  ],
  "pageIntro": {
    "/": {
      "heading": "Manly Warringah Painters",
      "subHeading": "Delivering Strata, Commercial and Residential Painting Services for over 25 years.",
      "text": "<p>Manly Warringah Painters were established on the Northern Beaches in 1995 by Frank Edwards and Alan Taylor and still going strong today. We are experienced in all types of painting and painting finishes. Frank and Alan  provide a friendly, professional service at a very competitive price.</p><p>At Manly Warringah Painters, we feel it's essential to choose the best painters to achieve the best possible result and expert looking finish when painting your property. As professional painters, we strive for perfection no matter how big or small the job is. Call us today for an obligation free <a href='/contact-us'>quote</a>.</p><p>It is important making sure the company you go with will take care of your painting project with its own employees without using sub-contractors. It became more common recently even well-known painting companies to sub-contract on the Northern Beaches. If the company is using sub-contractors, it means lower quality of service and increased cost</p>"
    },
    "/about-us": {
      "heading": "About us",
      "subHeading": "Take the pain out of painting with Manly Warringah Painters.",
      "text": "<p></p>At Manly Warringah Painters, our goal is to deliver a painting service which upholds quality workmanship and respect for the client’s home, as well as delivering great customer service to make the process is stress-free. We also aim to provide our customers with a professional painting service that offers superior customer satisfaction and quality results that look better... longer. We have over 25 years of experience in the painting industry and anyone can tell you we take pride in our work. No matter what scale of project we take on, from small residential painting touch-ups to commercial interior painting jobs, our team of qualified, professional painters are dedicated to providing exceptional painting services to our customers around the Northern Beaches and Sydney area</p><p> Manly Warringah Painters have been leading the way on the Northern Beaches and surrounding suburbs with their professional residential, commercial and industrial painting services. For houses, apartments, restaurants, offices, retail establishments, manufacturing facilities and more, we can offer you a professional personalised painting solutions.</p><p>You don't have to worry about us using subcontractors, so you can be assured that the painters that arrive at your place will be the owner-operators. This guarantees that the job is done properly, using the best materials in a timely fashion. All our work is guaranteed. When you go with Manly Warringah Painters, you can be assured top quality work in a timely fashion. </p>"
    },
    "/services": {
      "heading": "Services",
      "subHeading": "Manly Warringah Painters have over 25 years painting experience, delivering first class workmanship and competitive pricing.",
      "text": "<p>Manly Warringah Painters have been painting on the Northern Beaches for over 25 years. Manly Warringah Painters are fully insured and bonded to take care of your home’s painting needs for both interior and exterior. We offer a wide range of house painting services with competitive pricing. Please call us for a free, no obligation quote at <a href='tel:0412 128 847'><span> 0412 128 847</span></a>. Our team of house painters are highly experienced and trained professionals to deliver you the high-quality results for your home’s painting projects in and around the Sydney area at the lowest possible cost. We do the job and never sub-contract.</p><p>At Manly Warringah Painters, we have strong dealer relationships that we have with our suppliers received lower material costs, and we pass those savings on to you. Our goal is to provide you with top quality work at a price that you can afford.</p><p>The devil is in the details, so we always pay attention to the details to give you the best and longest lasting results. Every home painting project begins with necessary preparations; readying the surfaces, caulking, taking care of chipping or peeling paint, removal of water damage and mold, patching of nail holes, cracks, dents, and gouges. Other types of repairs may be necessary to repair or replace of drywall.</p>"
    },
    "/faqs": {
      "heading": "Frequently Asked Questions",
      "subHeading": "Q and A of some of the common questions our customers ask us.",
      "text": " <ul><li><strong> Why should a customer hire you over another service provider? </strong><p> At Manly Warringah Painters, we have over 25 years of experience in a wide variety of painting and decorating services. This means we can provide quality solutions to problems easier, faster and cost effectively. </p></li><li><strong> Is there a particular aspect of your trade or industry that you specialise in? </strong><p> We specialise in interior and exterior house painting, decorating, providing a high-quality and cost-effective result for the client. We have over 25 years' experience </p></li><li><strong> How do you normally charge for your service? </strong><p> We provide a no obligation free <a href='/contact-us'>quote</a> for jobs and projects that are well itemised based on an hourly rate and materials required for the work required </p></li><li><strong>What makes your pricing competitive?</strong><p> We are fast and highly efficient workers so you get real value for money on any work done. Our painting services are always done to a very high standard meaning no re-work is needed and it will last for years to come. We have been in the game a long time and have seen it all </p></li><li><strong> How can a customer save money before you start the work?</strong><p> The job can be done more efficiently by clearing out rooms and removing as much furniture as possible. We offer drop sheets and furniture protection but making it easy to move around means the job can be done faster and with less aches and pains. </p></li><li><strong> What are the typical things that you need to know before you can provide a quote to a customer? </strong><p> We need to know room sizes, wall heights, current colours on the walls. Dark colours being painted light will generally need extra coats to come up perfect. An idea of filling, repairing. Ceilings, skirtings, door frames, doors, cornices. picture rails, outside areas. We <a href='/contact-us'>quote</a> on site. </p></li><li><strong> Are you an insured business and do you guarantee your work? </strong><p> Yes, we are insured with 5 million in liability which covers property damage such as a paint tin getting knocked onto carpet, or a TV being knocked over and smashed. We Guarantee our work with 100% satisfaction and do a walk through prior to payment. Any issues we will come back. </p></li><li><strong> What makes you the most reliable and trustworthy person for the job? </strong><p> At Manly Warringah Painters, our reputation is extremely important to us and our business. We've been in business for 25 years. Trust is something that is built up over a long period of time. We can provide references and phone numbers of past clients to get reviews. </p></li><li><strong>What do you like most about your job?</strong><p>The parts of the job we like doing the work and seeing a transformation in a place and the more dramatic the transformation, the more enjoyable. I also enjoy the pleasure that owners get from a job well done through my efforts. </p></li></ul>"
    },
    "/contact-us": {
      "heading": "Contact Us",
      "subHeading": "For expert advice or to get a free <a href='/contact-us'>quote</a> please fill out the form, email or phone us."
    }
  },
  "brands": [
    "dulux.png",
    "britishPaints2.jpg",
    "cabots.jpg",
    "taubmans.jpg",
    "wattyl.png"
  ],
  "homeSpecialise": [
    {
      "image": "domestic.jpg",
      "title": "Domestic Painting",
      "text": "<p>When it comes to domestic painting, there is so much to think about when considering all the different painting & decorating options out there. Whether you’re thinking of residential interior painting, whether that be bedroom painting or kitchen painting, the best interior painting works to modernize and freshen your space from the inside out.</p><p>If you find yourself looking for home interior painting inspiration or guidance as far as house paint and painting interior walls is concerned, hiring professional house painters can really ease that pressure. Not only will the right professional house painters provide you with quality in home painting, but it frees up your time and energy to be thinking about your next interior room painting project!</p>"
    },
    {
      "image": "commercial.jpg",
      "title": "Commercial Painting",
      "text": "<p>Over the years, our work excellence, dedication, and commitment have made us stand at the top position among other painting companies on the Northern Beaches. Commercial projects that we’ve completed include cafes, restaurants, pubs, retail shops, hairdressers, warehouses and offices. Similar to our domestic work, we’ll happily take on a project of any size and can work on both interior and exterior walls.</p><p>We know running a business can be hard, and the last thing you want is a painter getting in the way. Manly Warringah Painters are able to work with you to create a plan that suits your business hours and minimises the disruption. We do this by working after hours and on weekends.</p>"
    },
    {
      "image": "interior.jpg",
      "title": "Interior Painting",
      "text": "<p>Interior Painting is about home maintenance and the protection of surfaces; Manly Warringah Painters have painted hundreds of homes and it seems to almost never be about maintenance. It is mostly about that new colour, the new trends, the new paint. It is all with good reason of course. You are painting anyway, why not explore all the possible colour choices out there. </p><p>There are many reasons to paint the interior of you home, whether you want to cover up wear and tear, to change the look of a room or to protect your interior surfaces, Manly Warringah Painters has the solution for you.</p>"
    },
    {
      "image": "exterior.jpg",
      "title": "Exterior Painting",
      "text": "<p>Manly Warringah Painters can cater to all your exterior painting needs. Whether you need to touch up a small area of your exterior paint job or repaint your project or home an entirely new colour, then Manly Warringah Painters are here to serve you.<p> We use only the best quality paints, brushes and rollers, and attention to detail is what we specialise in. We provide the best painting services through processes we have mastered over a 25-year period, we expertly clean and prepare all surfaces to ensure the finish coat will properly adhere and we are experts in covering all unpaintable areas.</p><p> Whether you want to remove marks and stains, protection against bad weather or increase home value, Manly Warringah Painters are the best in the business. </p></p>"
    }
  ],
  "aboutPro": " <h4>Talk to a professional painter, not a salesperson - <a href='/contact-us'>Get a quote</a></h4>",
  "standOutAreas": {
    "heading": "A few of the areas Manly Warringah Painters stand out from the rest",
    "style": "standOut",
    "listItems": [
      {
        "text": "Reliable, local, established and fully insured tradespeople",
        "icon": "faCheckCircle"
      },
      {
        "text": "Industry leading workmanship - using only the best paints and products",
        "icon": "faCheckCircle"
      },
      {
        "text": "Dulux accredited painters who only use the highest quality products",
        "icon": "faCheckCircle"
      },
      {
        "text": "100% accountability – all projects are backed by a 5-year workmanship guarantee",
        "icon": "faCheckCircle"
      },
      {
        "text": "Committed to the highest safety standards and to keeping work areas clear of mess",
        "icon": "faCheckCircle"
      },
      {
        "text": "Careful with belongings; always clean the home after the project is finalised",
        "icon": "faCheckCircle"
      },
      {
        "text": "Focus on thorough preparation work to ensure interior and exterior painting work is to the highest standard",
        "icon": "faCheckCircle"
      },
      {
        "text": "No hidden costs so you know what you're up for",
        "icon": "faCheckCircle"
      },
      {
        "text": "Free <a href='/contact-us'>quotes</a>, and work is started within just a few days of the go-ahead being given",
        "icon": "faCheckCircle"
      },
      {
        "text": "Cost effective, realistic and affordable pricing",
        "icon": "faCheckCircle"
      },
      {
        "text": "Professional, efficient and honest tradespeople that only use the best in paints and equipment",
        "icon": "faCheckCircle"
      },
      {
        "text": "We always take pride and care in all of our work from start to finish",
        "icon": "faCheckCircle"
      },
      {
        "text": "Always committed to providing work of the highest standards",
        "icon": "faCheckCircle"
      }
    ]
  },
  "accolades": {
    "heading": "Manly Warringah Painters - Professional House Painters And Decorators",
    "listItems": [
      {
        "text": "Over 25 years' experience",
        "icon": "faMedal"
      },
      {
        "text": "Interior and exterior",
        "icon": "faHome"
      },
      {
        "text": "Commercial, residential",
        "icon": "faBuilding"
      },
      {
        "text": "Reliable and honest",
        "icon": "faUserFriends"
      },
      {
        "text": "Licensed and insured",
        "icon": "faCertificate"
      },
      {
        "text": "Timely completion",
        "icon": "faClock"
      },
      {
        "text": "Expert colour advice",
        "icon": "faAward"
      },
      {
        "text": "Satisfaction guarantee",
        "icon": "faStar"
      },
      {
        "text": "Personalised service",
        "icon": "faPeopleArrows"
      },
      {
        "text": "Value for money",
        "icon": "faCommentDollar"
      },
      {
        "text": "Fixed price",
        "icon": "faDollarSign"
      },
      {
        "text": "Best products available",
        "icon": "faTrophy"
      }
    ]
  },
  "servicesXXXTODO": {
    "heading": "The experienced domestic and commercial painters on the Northern Beaches",
    "listItems": [
      {
        "text": "Over 25 years' experience",
        "icon": "faMedal"
      },
      {
        "text": "Interior and exterior",
        "icon": "faHome"
      },
      {
        "text": "Commercial, residential",
        "icon": "faBuilding"
      },
      {
        "text": "Reliable and honest",
        "icon": "faUserFriends"
      },
      {
        "text": "Licensed and insured",
        "icon": "faCertificate"
      },
      {
        "text": "Timely completion",
        "icon": "faClock"
      },
      {
        "text": "Expert colour advice",
        "icon": "faAward"
      },
      {
        "text": "Satisfaction guarantee",
        "icon": "faStar"
      },
      {
        "text": "Personalised service",
        "icon": "faPeopleArrows"
      },
      {
        "text": "Value for money",
        "icon": "faCommentDollar"
      },
      {
        "text": "Fixed price",
        "icon": "faDollarSign"
      },
      {
        "text": "Best products available",
        "icon": "faTrophy"
      }
    ]
  },
  "services": {
    "heading": "The experienced domestic and commercial painters on the Northern Beaches",
    "listItems": [
      {
        "text": "Interior & Exterior Painting",
        "icon": "faPaintRoller"
      },
      {
        "text": "Residential Homes and Units",
        "icon": "faBrush"
      },
      {
        "text": "Drywall And Plaster Repairs",
        "icon": "faBrush"
      },
      {
        "text": "Feature Wall Painting",
        "icon": "faPaintRoller"
      },
      {
        "text": "Wall & Ceiling Painting",
        "icon": "faBrush"
      },
      {
        "text": "New and Old Properties",
        "icon": "faPaintRoller"
      },
      {
        "text": "Restorations & Renovations",
        "icon": "faBrush"
      },
      {
        "text": "Repainting Gutters",
        "icon": "faPaintRoller"
      },
      {
        "text": "Fascia and Downpipes",
        "icon": "faBrush"
      },
      {
        "text": "Rendered Exteriors",
        "icon": "faPaintRoller"
      },
      {
        "text": "Exposed Brickwork",
        "icon": "faBrush"
      },
      {
        "text": "Roofing including Colourbond, Iron and Tiles",
        "icon": "faPaintRoller"
      },
      {
        "text": "Weatherboards",
        "icon": "faBrush"
      },
      {
        "text": "Fences",
        "icon": "faPaintRoller"
      },
      {
        "text": "Steel",
        "icon": "faBrush"
      },
      {
        "text": "Plasterboard",
        "icon": "faPaintRoller"
      },
      {
        "text": "Textured painting",
        "icon": "faBrush"
      },
      {
        "text": "Spray painting",
        "icon": "faPaintRoller"
      },
      {
        "text": "Doors and trims",
        "icon": "faBrush"
      },
      {
        "text": "Restoration jobs",
        "icon": "faPaintRoller"
      },
      {
        "text": "Wood staining",
        "icon": "faBrush"
      },
      {
        "text": "Walls, Ceilings and Trim",
        "icon": "faPaintRoller"
      },
      {
        "text": "Cabinets and Built-ins",
        "icon": "faBrush"
      },
      {
        "text": "Brick Staining and Painting",
        "icon": "faPaintRoller"
      },
      {
        "text": "Epoxy and Enamel Floors",
        "icon": "faBrush"
      },
      {
        "text": "Wallpaper Installation",
        "icon": "faPaintRoller"
      },
      {
        "text": "Staining and Varnishing",
        "icon": "faBrush"
      },
      {
        "text": "Vinyl Siding Painting",
        "icon": "faPaintRoller"
      },
      {
        "text": "Metal & Plastic Siding Painting",
        "icon": "faBrush"
      },
      {
        "text": "Stucco Painting",
        "icon": "faPaintRoller"
      },
      {
        "text": "Deck and Fence Painting",
        "icon": "faBrush"
      },
      {
        "text": "Brick and Masonry Painting",
        "icon": "faPaintRoller"
      },
      {
        "text": "Specialty Products",
        "icon": "faBrush"
      },
      {
        "text": "Commercial Painting Services",
        "icon": "faPaintRoller"
      },
      {
        "text": "Office Painting",
        "icon": "faBrush"
      },
      {
        "text": "Renovations, New Builds and Fit ups",
        "icon": "faPaintRoller"
      },
      {
        "text": "Apartment Painting",
        "icon": "faBrush"
      },
      {
        "text": "Warehouse Painting",
        "icon": "faPaintRoller"
      },
      {
        "text": "Parkade Painting",
        "icon": "faBrush"
      },
      {
        "text": "Painting and Staining of Brick and Masonry",
        "icon": "faPaintRoller"
      },
      {
        "text": "Epoxy Painting",
        "icon": "faBrush"
      },
      {
        "text": "Store Fronts Painting",
        "icon": "faPaintRoller"
      },
      {
        "text": "Vinyl Wallcoverings",
        "icon": "faBrush"
      },
      {
        "text": "Hotel Industry Painting",
        "icon": "faPaintRoller"
      },
      {
        "text": "Painting of Day-care and Schools",
        "icon": "faBrush"
      },
      {
        "text": "And much more",
        "icon": "faPaintRoller"
      }
    ]
  },
  "servicesX": [
    "Interior & Exterior Painting",
    "Residential Homes and Units",
    "Drywall And Plaster Repairs",
    "Feature Wall Painting",
    "Wall & Ceiling Painting",
    "New and Old Properties",
    "Restorations & Renovations",
    "Repainting gutters",
    "fascia and downpipes",
    "Rendered exteriors",
    "Exposed brickwork",
    "Roofing including colorbond, iron and tiles",
    "Weatherboards",
    "Fences",
    "Steel",
    "Plasterboard",
    "Textured painting",
    "Spray painting",
    "Doors and trims",
    "Restoration jobs",
    "Wood staining",
    "Walls, Ceilings and Trim ",
    "Cabinets and Built-ins",
    "Brick Staining and Painting ",
    "Epoxy and Enamel Floors ",
    "Wallpaper Installation ",
    "Staining and Varnishing ",
    "Vinyl Siding Painting ",
    "Metal & Plastic Siding Painting ",
    "Stucco Painting",
    "Deck and Fence Painting ",
    "Brick and Masonry Painting ",
    "Specialty Products ",
    "Commercial Painting Services ",
    "Office Painting ",
    "Renovations, New Builds and Fitups ",
    "Apartment Painting ",
    "Warehouse Painting ",
    "Parkade Painting ",
    "Painting and Staining of Brick and Masonry ",
    "Epoxy Painting ",
    "Store Fronts Painting ",
    "Vinyl Wallcoverings ",
    "Hotel Industry Painting ",
    "Painting of Daycare and Schools ",
    "And much more."
  ],
  "serviceAreas": {
    "heading": "Service Areas",

    "page": "services",
    "text": "<p>Manly Warringah Painters specialise at working on the Northern beaches but are happy to work in other areas in and around Sydney. We value the opportunity to assess the job and to discuss and offer the best options and solutions in paints, techniques, colour schemes and approaches for your project. We want to be sure that we translate your visions for your home or business.</p><p>We provide professional advice because we care about customer satisfaction and the final result. So for quality painting services, you can’t beat the experience, professionalism and personal attention of Manly Warringah Painters. We are ready to answer your questions about your painting needs. Please call us for a free, no obligation written estimate If you’re interested in a <a href='/contact-us'>quote</a></p>",
    "image": "mwpMap2.png",
    "alt": "We provide professional advice"
  },
  "reviews": [
    {
      "rating": 5,
      "customer": "Peter McKenzie",
      "review": "Top quality job from Frank and Alan. Fast and my house looks amazing, Thanks guys."
    },
    {
      "rating": 5,
      "customer": "Trevor Brandt",
      "review": "Manly Warringah Painters made my house look incredible in such a short time. Highly recommended!"
    },
    {
      "rating": 5,
      "customer": "Michelle Rogers",
      "review": "Great pricing for quality work. Very clean when working. Our house feels like a show home now! Great job Manly Warringah Painters."
    },
    {
      "rating": 5,
      "customer": "Alex Peterson",
      "review": "We have used Manly Warringah Painters a number of times and they have always done amazing work. Time managing, professional and clean. First class service."
    },
    {
      "rating": 5,
      "customer": "Giovanni Bianchi",
      "review": "The whole experience from start to finish with Manly Warringah Painters blew me away. Honest advice, outstanding communication, impeccable job at a fair price."
    },
    {
      "rating": 5,
      "customer": "Jenifer Byrne",
      "review": "The guys from Manly Warringah Painters did a wonderful job and were so efficient, professional and polite. Highly recommend them."
    }
  ]
}
