{
  "nav": [
    { "name": "HOME", "link": "/" },
    { "name": "ABOUT US", "link": "about-us" },
    { "name": "SERVICES", "link": "services" },
    { "name": "FAQs", "link": "faqs" },
    { "name": "CONTACT US", "link": "contact-us" }
  ],
  "pageIntro": {
    "/": {
      "heading": "Manly Warringah Painters",
      "text": "Delivering Strata, Commercial and Residential Painting Services for over 25 years."
    },
    "/about-us": {
      "heading": "About us",
      "text": "Delivering Strata, Commercial and Residential Painting Services for over 25 years."
    },
    "/services": {
      "heading": "Services",
      "text": "Manly Warringah Painter have over 25 years painting experience, delivering first class workmanship and competitive pricing."
    },
    "/faqs": {
      "heading": "FAQs",
      "text": "Q and A of some of the common questions our customers ask us"
    },
    "/contact-us": {
      "heading": "Contact Us",
      "text": "For expert advice or to get a free quote please fill out the form, email or phone us."
    }
  },
  "iconsX": [
    { "title": "Experience", "icon": "faGem" },
    { "title": "Courteous", "icon": "faThumbsUp" },
    { "title": "Fancy", "icon": "faPhoneVolume" }
  ],
  "brands": [
    "dulux.png",
    "britishPaints2.jpg",
    "cabots.jpg",
    "taubmans.jpg",
    "wattyl.png"
  ],
  "homeIntro": [
    "<p>Manly Warringah Painters were established on the Northern Beaches in 1995 by Alan Taylor and Frank Edwards and still going strong today. We are experienced in all types of painting and painted finishes. Alan and Frank provide a friendly, professional service at a very competitive price.</p><p>At Manly Warringah Painters, we feel it's essential to choose the best painters to achieve the best possible result and expert looking finish when painting your property. As professional painters, we strive for perfection no matter how big or small the job is. Call us today for an obligation free quote.</p><p>It is important making sure the company you go with will take care of your painting project with its own employees without using sub-contractors. It became more common recently even well known painting companies to sub-contract on the Northern Beaches. If the company is using sub-contractors, it means lower quality of service and increased cost</p>"
  ],
  "homeSpecialise": [
    {
      "image": "domestic.jpg",
      "title": "Domestic Painting",
      "text": "<p>When it comes to  interior painting, there is so much to think about when considering all the different painting & decorating options out there. Whether you’re thinking of residential interior painting, whether that be bedroom painting or kitchen painting, the best interior painting works to modernize and freshen your space from the inside out.</p><p>If you find yourself looking for home interior painting inspiration or guidance as far as house paint and painting interior walls is concerned, hiring professional house painters can really ease that pressure. Not only will the right professional house painters provide you with quality in home painting, but it frees up your time and energy to be thinking about your next interior room painting project!.</p>"
    },
    {
      "image": "commercial.jpg",
      "title": "Commercial Painting",
      "text": "<p>Over the years, our work excellence, dedication, and commitment have made us stand at the top position among other painting Melbourne companies. Commercial projects that we’ve completed include cafes, restaurants, pubs, retail shops, hairdressers, warehouses and offices. Similar to our domestic work, we’ll happily take on a project of any size and can work on both interior and exterior walls.</p><p>We know running a business can be hard, and the last thing you want is a painter getting in the way. Our painting Melbourne&nbsp;are able to work with you to create a plan that suits your business hours and minimises the disruption. We do this by working after hours and on weekends.</p>"
    },
    {
      "image": "interior.jpg",
      "title": "Interior Painting",
      "text": "<p>Interior Painting is about home maintenance and the protection of surfaces, Manly Warringah Painters have painted hundreds of homes and it seems to almost never be about maintenance. It is mostly about that new colour, the new trends, the new paint. It is all with good reason of course. You are painting anyway, why not explore all the possible colour choices out there. </p><p>There are many reasons to paint the interior of  you home, whether you want to cover up wear and tear, to change the look of a room or to protect your interior surfaces, Manly Warringah Painters has the solution for you.</p>"
    },
    {
      "image": "exterior.jpg",
      "title": "Exterior Painting",
      "text": "<p>Manly Warringah Painters can cater to all your exterior painting needs. Whether you need to touch up a small area of your exterior paint job or repaint your project or home an entirely new colour, then Manly Warringah Painters are here to serve you.<p> We use only the best quality paints, brushes and rollers, and attention to detail is what we specialise in. We provide the best painting services thorough painting processes we have mastered over a 25-year period, we expertly clean and prepare all surfaces to ensure the finish coat will properly adhere and we are experts in covering all unpaintable areas.</p><p> Whether you want to remove marks and stains, protection against bad weather or increase home value, Manly Warringah Painters are the best in the business.</p></p>"
    }
  ],
  "about": [
    "<p></p>At Manly Warringah Painters our goal is to deliver a painting service which upholds quality workmanship and respect for the client’s home, as well as delivering great customer service to make the process stress-free. We also aim to provide our customers with a professional painting service that offers superior customer satisfaction and quality results that look better....longer. We have over 25 years of experience in the painting industry and anyone can tell you we take pride in our work. No matter what scale of project we take on, from small residential painting touch ups to commercial interior painting jobs, our team of qualified, professional painters are dedicated to providing exceptional painting services to our customers around the Northern Beaches and Sydney area</p><p> Manly Warringah Painters have been leading the way on the Northern Beaches and sorrounding suburbs with their professional residential, commercial and industrial painting services. For houses, apartments, restaurants, offices, retail establishments, manufacturing facilities and more, we can offer you a professional personalized painting solutions</p><p>You don't have to worry about us using subcontractors, so you can be assured that the painters that arrive at your place will be the owner operators. This guarantees that the job is done properly, using the best materials in a timely fashion. All our work is guaranteed. When you go with Manly Warringah Painters, you can be assured top quality work in a timely fashion </p>"
  ],
  "aboutPro": " <p>Talk To A Professional Painter, Not A Salesperson - <span><a href='tel:0412 128 847'>0412 128 847</a></span></p>",
  "standOutAreas": [
    "Reliable, local, established and fully insured tradespeople",
    "Industry leading workmanship using the finest products",
    "Experienced residential, commercial, strata painters",
    "Reputable, honest, professional and meticulous",
    "Proactive, regular updates on how the job is progressing",
    "No-fuss, get-the-job-done approach",
    "Over 80% of our new clientele come to us because of referrals from happy customers ",
    "100% accountability – all projects are backed by a 5-year workmanship guarantee",
    "Dulux accredited painters who only use high-quality paint brands ",
    "Committed to the highest safety standards and to keeping work areas clear of mess",
    "Careful with belongings; always clean the home after the project is finalised",
    "Focus on intensive preparation work to ensure interior and exterior painting work is excellent",
    "No hidden costs so you know what you're up for",
    "Free quotes, and work is started within just a few days of the  go-ahead being given",
    "Cost effective, realistic and affordable pricing",
    "Honest & professional tradespeople  that only use the best in paints and equipment",
    "We always take pride in all of our work from start to finish",
    "Dedicated to providing work of the highest standards"
  ],
  "servicesIntro": "<p>Manly Warringah Painters have been painting on the Northern Beaches for over 25 years. Manly Warringah Painters is fully insured and bonded to take care of our home’s painting needs for both interior and exterior. We offer a wide range of house painting services in Toronto area with competitive pricing. Please call us for a free, no obligation written estimate at <a href='tel:0412 128 847'><span> 0412 128 847</span></a>. Our team of house painters are highly experienced and trained professionals to deliver you the high quality results for your home’s painting projects in and around the Sydney area at the lowest possible cost. We do the job and never sub-contract.</p><p>Manly Warringah Painters has strong dealer relationships that we have with our suppliers received lower material costs, and we pass those savings on to you. Our goal is to provide you with top quality work at a price that you can afford.</p><p>The devil is in the details, so we always pay attention to the details to give you the best and longest lasting results. Every home painting project begins with necessary preparations; readying the surfaces, caulking , taking care of chipping or peeling paint, removal of water damage and mold, patching of nail holes, cracks, dents, and gouges. Other types of repair may be necessary to repair or replace of drywall.</p>",
  "services": [
    "Interior & Exterior Painting",
    "Residential Homes and Units",
    "Drywall And Plaster Repairs",
    "Feature Wall Painting",
    "Wall & Ceiling Painting",
    "New and Old Properties",
    "Restorations & Renovations",
    "Repainting gutters",
    "fascia and downpipes",
    "Rendered exteriors",
    "Exposed brickwork",
    "Roofing including colorbond, iron and tiles",
    "Weatherboards",
    "Fences",
    "Steel",
    "Plasterboard",
    "Textured painting",
    "Spray painting",
    "Doors and trims",
    "Restoration jobs",
    "Wood staining",
    "Walls, Ceilings and Trim ",
    "Cabinets and Built-ins",
    "Brick Staining and Painting ",
    "Epoxy and Enamel Floors ",
    "Wallpaper Installation ",
    "Staining and Varnishing ",
    "Vinyl Siding Painting ",
    "Metal & Plastic Siding Painting ",
    "Stucco Painting",
    "Deck and Fence Painting ",
    "Brick and Masonry Painting ",
    "Specialty Products ",
    "Commercial Painting Services ",
    "Office Painting ",
    "Renovations, New Builds and Fitups ",
    "Apartment Painting ",
    "Warehouse Painting ",
    "Parkade Painting ",
    "Painting and Staining of Brick and Masonry ",
    "Epoxy Painting ",
    "Store Fronts Painting ",
    "Vinyl Wallcoverings ",
    "Hotel Industry Painting ",
    "Painting of Daycare and Schools ",
    "And much more."
  ],
  "serviceAreas": "<p>At Manly Warringah Painters, we can cater to your small to large painting projects whether that may be a one-off job or an ongoing work contract that forms part of a planned maintenance program.</p><p>Manly Warringah Painters specialise at working on the Northern beaches but are happy to work in other areas in and around Sydney. We value the opportunity to assess the job and to discuss and offer the best options and solutions in paints, techniques, colour schemes and approaches for your project. We want to be sure that we translate your visions for your home or business.</p><p>We provide professional advice because we care about customer satisfaction and the final result.</p>",
  "serviceAreaImage": "mwpMap2.png",
  "reviews": [
    {
      "rating": 5,
      "customer": "Peter McKenzie",
      "review": "Top quality job from Frank and Alan. Fast and my house looks amazing, Thanks guys."
    },
    {
      "rating": 5,
      "customer": "Trevor Brandt",
      "review": "Manly Warringah Painters made my house look incredible in such a short time. Highly recommend!"
    },
    {
      "rating": 5,
      "customer": "Michelle Rogers",
      "review": "Great pricing for quality work. Very clean when working. Our house feels like a show home now! Great job Manly Warringah Painters."
    },
    {
      "rating": 5,
      "customer": "Alex Peterson",
      "review": "We used Manly Warringah Painters a number of times and have always been amazing on the job. Time managing, professional and clean. First class service. ."
    },
    {
      "rating": 5,
      "customer": "Jeniffer Byrne",
      "review": "The guys from Manly Warringah Painters did a wonderful job and were so efficient, professional and polite. Highly recommend them."
    }
  ]
}
